ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_dma.c
/**
  ******************************************************************************
  * @file    bl606p_dma.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p.h"
#include "bl606p_dma.h"
#include "bl606p_glb.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DMA
 *  @{
 */

/** @defgroup  DMA_Private_Macros
 *  @{
 */
#define DMA_CHANNEL_OFFSET           0x100
#define DMA_Get_Channel(id_base, ch) ((id_base) + DMA_CHANNEL_OFFSET + (ch)*0x100)

/*@} end of group DMA_Private_Macros */

/** @defgroup  DMA_Private_Types
 *  @{
 */

/*@} end of group DMA_Private_Types */

/** @defgroup  DMA_Private_Variables
 *  @{
 */
static const uint32_t dmaAddr[DMA_ID_MAX] = { DMA0_BASE, DMA1_BASE, DMA2_BASE };
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *dmaIntCbfArra[DMA_ID_MAX][DMA_CH_MAX][DMA_INT_ALL] = {
    { { NULL } }
};
#endif
static DMA_LLI_Ctrl_Type PingPongListArra[DMA_ID_MAX][DMA_CH_MAX][2];

/*@} end of group DMA_Private_Variables */

/** @defgroup  DMA_Global_Variables
 *  @{
 */

/*@} end of group DMA_Global_Variables */

/** @defgroup  DMA_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static void DMA_IntHandler(DMA_ID_Type dmaId);
#endif
static void CPU_Interrupt_Enable_DMA(DMA_ID_Type dmaId);
static void CPU_Interrupt_Disable_DMA(DMA_ID_Type dmaId);

/*@} end of group DMA_Private_Fun_Declaration */

/** @defgroup  DMA_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DMA interrupt handler
 *
 * @param  dmaId: DMA ID type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void DMA_IntHandler(DMA_ID_Type dmaId)
{
    uint32_t tmpVal;
    uint32_t intClr;
    uint8_t ch;
    /* Get DMA register */
    uint32_t DMAChs = dmaAddr[dmaId];

    for (ch = 0; ch < DMA_CH_MAX; ch++) {
        tmpVal = BL_RD_REG(DMAChs, DMA_INTTCSTATUS);

        if ((BL_GET_REG_BITS_VAL(tmpVal, DMA_INTTCSTATUS) & (1 << ch)) != 0) {
            /* Clear interrupt */
            tmpVal = BL_RD_REG(DMAChs, DMA_INTTCCLEAR);
            intClr = BL_GET_REG_BITS_VAL(tmpVal, DMA_INTTCCLEAR);
            intClr |= (1 << ch);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_INTTCCLEAR, intClr);
            BL_WR_REG(DMAChs, DMA_INTTCCLEAR, tmpVal);

            if (dmaIntCbfArra[dmaId][ch][DMA_INT_TCOMPLETED] != NULL) {
                /* Call the callback function */
                dmaIntCbfArra[dmaId][ch][DMA_INT_TCOMPLETED]();
            }
        }
    }

    for (ch = 0; ch < DMA_CH_MAX; ch++) {
        tmpVal = BL_RD_REG(DMAChs, DMA_INTERRORSTATUS);

        if ((BL_GET_REG_BITS_VAL(tmpVal, DMA_INTERRORSTATUS) & (1 << ch)) != 0) {
            /*Clear interrupt */
            tmpVal = BL_RD_REG(DMAChs, DMA_INTERRCLR);
            intClr = BL_GET_REG_BITS_VAL(tmpVal, DMA_INTERRCLR);
            intClr |= (1 << ch);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_INTERRCLR, intClr);
            BL_WR_REG(DMAChs, DMA_INTERRCLR, tmpVal);

            if (dmaIntCbfArra[dmaId][ch][DMA_INT_ERR] != NULL) {
                /* Call the callback function */
                dmaIntCbfArra[dmaId][ch][DMA_INT_ERR]();
            }
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  CPU enable DMA interrupt
 *
 * @param  dmaId: DMA ID type
 *
 * @return None
 *
*******************************************************************************/
static void CPU_Interrupt_Enable_DMA(DMA_ID_Type dmaId)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));

    if (DMA0_ID == dmaId) {
        CPU_Interrupt_Enable(DMA0_ALL_IRQn);
    } else if (DMA1_ID == dmaId) {
        CPU_Interrupt_Enable(DMA1_ALL_IRQn);
    } else {
        CPU_Interrupt_Enable(DMA2_INT0_IRQn);
        CPU_Interrupt_Enable(DMA2_INT1_IRQn);
        CPU_Interrupt_Enable(DMA2_INT2_IRQn);
        CPU_Interrupt_Enable(DMA2_INT3_IRQn);
        CPU_Interrupt_Enable(DMA2_INT4_IRQn);
        CPU_Interrupt_Enable(DMA2_INT5_IRQn);
        CPU_Interrupt_Enable(DMA2_INT6_IRQn);
        CPU_Interrupt_Enable(DMA2_INT7_IRQn);
    }
}

/****************************************************************************/ /**
 * @brief  CPU disable DMA interrupt
 *
 * @param  dmaId: DMA ID type
 *
 * @return None
 *
*******************************************************************************/
static void CPU_Interrupt_Disable_DMA(DMA_ID_Type dmaId)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));

    if (DMA0_ID == dmaId) {
        CPU_Interrupt_Disable(DMA0_ALL_IRQn);
    } else if (DMA1_ID == dmaId) {
        CPU_Interrupt_Disable(DMA1_ALL_IRQn);
    } else {
        CPU_Interrupt_Disable(DMA2_INT0_IRQn);
        CPU_Interrupt_Disable(DMA2_INT1_IRQn);
        CPU_Interrupt_Disable(DMA2_INT2_IRQn);
        CPU_Interrupt_Disable(DMA2_INT3_IRQn);
        CPU_Interrupt_Disable(DMA2_INT4_IRQn);
        CPU_Interrupt_Disable(DMA2_INT5_IRQn);
        CPU_Interrupt_Disable(DMA2_INT6_IRQn);
        CPU_Interrupt_Disable(DMA2_INT7_IRQn);
    }
}

/*@} end of group DMA_Private_Functions */

